a = int ( input ( ' กรอกคะแนนเก็บ! *คะแนนเก็บไม่เกิน 30 คะแนน : ' ) )
b = int ( input ( ' กรอกคะแนนสอบกลางภาค! *คะแนนสอบกลางภาคไม่เกิน 30 คะแนน : ' ) )
c = int ( input ( ' กรอกคะแนนสอบปลายภาค! *คะแนนสอบปลายภาคไม่เกิน 40 คะแนน : ' ) )
d = a + b + c 
if ( d >= 80 ) :
    print ( ' ได้เกรด A ' )
elif ( d >= 75 ) :
    print ( ' ได้เกรด B+ ' )
elif ( d >= 70 ) :
    print ( ' ได้เกรด B ' )
elif ( d >= 65 ) :
    print ( ' ได้เกรด C+ ' )
elif ( d >= 60 ) : 
    print ( ' ได้เกรด C ' )
elif ( d >= 55 ) :
    print ( ' ได้เกรด D+ ')
elif ( d >= 50 ) :
    print ( ' ได้เกรด D ')
else :
    print ( ' ได้เกรด C ' )